In [30]:
%load_ext autoreload
%autoreload 2

# Importing necessary libraries and the functions from the provided file
import pandas as pd
from pandas import DataFrame
from shuffle_sample import column_shuffle_df, row_shuffle_df, sample_df, get_permutations

# Create DataFrame
data = {
    'int': [1, 2, 3, 4, 5],
    'str': ['apple', 'pear', 'grape', 'kiwi', 'lime'],
    'duplicates': ['dog', 'cat', 'bird', 'cat', 'dog']
}

df = pd.DataFrame(data)

df

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [31]:
column_shuffle_tables, perms  = column_shuffle_df(df, 10)
# The first table will be the original table
column_shuffle_tables[0]

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [32]:
column_shuffle_tables[1]

     str duplicates  int
0  apple        dog    1
1   pear        cat    2
2  grape       bird    3
3   kiwi        cat    4
4   lime        dog    5

In [33]:
row_shuffle_tables = row_shuffle_df(df, 10)
row_shuffle_tables[1]

   int    str duplicates
2    3  grape       bird
3    4   kiwi        cat
1    2   pear        cat
0    1  apple        dog
4    5   lime        dog

In [34]:
sample_tables = sample_df(df, 10 , 0.5)
sample_tables[1]

   int    str duplicates
0    1  apple        dog
2    3  grape       bird

In [35]:
sample_tables[0]

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [36]:
from single_table_processing import get_most_similar_rows
text_to_compare = "My dog loves to eat pear"
similar_rows = get_most_similar_rows(df, text_to_compare, k = 3)
similar_rows

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
4    5   lime        dog

In [37]:

from single_table_processing import get_most_similar_rows


text_to_compare = "My dog loves to eat pear"
similar_rows = get_most_similar_rows(df, text_to_compare)
print(similar_rows)

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
4    5   lime        dog
2    3  grape       bird
3    4   kiwi        cat

In [38]:
similar_rows = get_most_similar_rows(df, text_to_compare, k = 3)
similar_rows

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
4    5   lime        dog

In [39]:
from single_table_processing import get_most_similar_cols
text_to_compare = "My cat loves to eat pear"
similar_cols = get_most_similar_cols(df, text_to_compare)
similar_cols

  duplicates    str  int
0        dog  apple    1
1        cat   pear    2
2       bird  grape    3
3        cat   kiwi    4
4        dog   lime    5

In [40]:
df

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [41]:
from single_table_processing import rank_rows_by_tfidf

rank_rows_by_tfidf(df)

   int    str duplicates
2    3  grape       bird
0    1  apple        dog
1    2   pear        cat
3    4   kiwi        cat
4    5   lime        dog

In [42]:
from huggingface_dataset import *

In [43]:

# Generating a table where the cell value is the multiplication of the column number and the row number
long_table_multiplied = {
    f"Column_{i}": [i * j for j in range(100)] for i in range(10)
}

# Converting the table to a DataFrame for display
df_long_table_multiplied = DataFrame(long_table_multiplied)
df_long_table_multiplied.head(10)  # Displaying the first 10 rows of the table for reference

,Column_0,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8,Column_9
0,0,0,0,0,0,0,0,0,0,0
1,0,1,2,3,4,5,6,7,8,9
2,0,2,4,6,8,10,12,14,16,18
3,0,3,6,9,12,15,18,21,24,27
4,0,4,8,12,16,20,24,28,32,36
5,0,5,10,15,20,25,30,35,40,45
6,0,6,12,18,24,30,36,42,48,54
7,0,7,14,21,28,35,42,49,56,63
8,0,8,16,24,32,40,48,56,64,72
9,0,9,18,27,36,45,54,63,72,81

In [44]:
def number_to_words(num):
    """Convert a number into words."""
    if num == 0:
        return 'zero'

    under_20 = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten',
                'eleven', 'twelve', 'thirteen', 'fourteen', 'fifteen', 'sixteen', 'seventeen', 'eighteen', 'nineteen']

    tens = ['', '', 'twenty', 'thirty', 'forty', 'fifty', 'sixty', 'seventy', 'eighty', 'ninety']

    if num < 20:
        return under_20[num - 1]

    if num < 100:
        return tens[num // 10] + ('' if num % 10 == 0 else ' ' + under_20[num % 10 - 1])

    if num < 1000:
        return under_20[num // 100 - 1] + ' hundred' + ('' if num % 100 == 0 else ' ' + number_to_words(num % 100))

    if num < 1000000:
        return number_to_words(num // 1000) + ' thousand' + ('' if num % 1000 == 0 else ' ' + number_to_words(num % 1000))

    return str(num)  # This function handles up to 999,999; other numbers will be returned as-is

# Convert the cell values in the DataFrame to English words
for col in df_long_table_multiplied.columns:
    df_long_table_multiplied[col] = df_long_table_multiplied[col].apply(lambda x: number_to_words(int(x)))

df_long_table_multiplied.head(10)

,Column_0,Column_1,Column_2,Column_3,Column_4,Column_5,Column_6,Column_7,Column_8,Column_9
0,zero,zero,zero,zero,zero,zero,zero,zero,zero,zero
1,zero,one,two,three,four,five,six,seven,eight,nine
2,zero,two,four,six,eight,ten,twelve,fourteen,sixteen,eighteen
3,zero,three,six,nine,twelve,fifteen,eighteen,twenty one,twenty four,twenty seven
4,zero,four,eight,twelve,sixteen,twenty,twenty four,twenty eight,thirty two,thirty six
5,zero,five,ten,fifteen,twenty,twenty five,thirty,thirty five,forty,forty five
6,zero,six,twelve,eighteen,twenty four,thirty,thirty six,forty two,forty eight,fifty four
7,zero,seven,fourteen,twenty one,twenty eight,thirty five,forty two,forty nine,fifty six,sixty three
8,zero,eight,sixteen,twenty four,thirty two,forty,forty eight,fifty six,sixty four,seventy two
9,zero,nine,eighteen,twenty seven,thirty six,forty five,fifty four,sixty three,seventy two,eighty one

In [52]:
from transformers import BertTokenizer
tokenizer = BertTokenizer.from_pretrained('bert-base-uncased')

In [53]:
example_tables = chunk_tables([df_long_table_multiplied, df_long_table_multiplied], 'bert-base-uncased', 512, tokenizer, max_col=3, max_row=10, max_token_per_cell=1)

In [59]:
example_tables = chunk_neighbor_tables([df_long_table_multiplied, df_long_table_multiplied],  'Column_4',2, 'bert-base-uncased', 512, tokenizer)

In [60]:
# for table in example_tables:
#     print(table)

{'table':         Column_2      Column_3      Column_4             Column_5  \
0           zero          zero          zero                 zero
1            two         three          four                 five
2           four           six         eight                  ten
3            six          nine        twelve              fifteen
4          eight        twelve       sixteen               twenty
5            ten       fifteen        twenty          twenty five
6         twelve      eighteen   twenty four               thirty
7       fourteen    twenty one  twenty eight          thirty five
8        sixteen   twenty four    thirty two                forty
9       eighteen  twenty seven    thirty six           forty five
10        twenty        thirty         forty                fifty
11    twenty two  thirty three    forty four           fifty five
12   twenty four    thirty six   forty eight                sixty
13    twenty six   thirty nine     fifty two           sixty five
14  twenty eight     forty two     fifty six              seventy
15        thirty    forty five         sixty         seventy five
16    thirty two   forty eight    sixty four               eighty
17   thirty four     fifty one   sixty eight          eighty five
18    thirty six    fifty four   seventy two               ninety
19  thirty eight   fifty seven   seventy six          ninety five
20         forty         sixty        eighty          one hundred
21     forty two   sixty three   eighty four     one hundred five
22    forty four     sixty six  eighty eight      one hundred ten
23     forty six    sixty nine    ninety two  one hundred fifteen
24   forty eight   seventy two    ninety six   one hundred twenty

                    Column_6
0                       zero
1                        six
2                     twelve
3                   eighteen
4                twenty four
5                     thirty
6                 thirty six
7                  forty two
8                forty eight
9                 fifty four
10                     sixty
11                 sixty six
12               seventy two
13             seventy eight
14               eighty four
15                    ninety
16                ninety six
17           one hundred two
18         one hundred eight
19      one hundred fourteen
20        one hundred twenty
21    one hundred twenty six
22    one hundred thirty two
23  one hundred thirty eight
24    one hundred forty four  , 'position': ((2, 7), (0, 25)), 'index': 0}
{'table':          Column_2                  Column_3                  Column_4  \
25          fifty              seventy five               one hundred
26      fifty two             seventy eight          one hundred four
27     fifty four                eighty one         one hundred eight
28      fifty six               eighty four        one hundred twelve
29    fifty eight              eighty seven       one hundred sixteen
30          sixty                    ninety        one hundred twenty
31      sixty two              ninety three   one hundred twenty four
32     sixty four                ninety six  one hundred twenty eight
33      sixty six               ninety nine    one hundred thirty two
34    sixty eight           one hundred two    one hundred thirty six
35        seventy          one hundred five         one hundred forty
36    seventy two         one hundred eight    one hundred forty four
37   seventy four        one hundred eleven   one hundred forty eight
38    seventy six      one hundred fourteen     one hundred fifty two
39  seventy eight     one hundred seventeen     one hundred fifty six
40         eighty        one hundred twenty         one hundred sixty
41     eighty two  one hundred twenty three    one hundred sixty four
42    eighty four    one hundred twenty six   one hundred sixty eight
43     eighty six   one hundred twenty nine   one hundred seventy two
44   eighty eight    one hundred thirty two   one hundred seventy six
45         ninety   one hundred thirty five        one hundred eighty
46     ninety two  one hundred thirty eight   one hundred eighty four
47    ninety four     one hundred forty one  one hundred eighty eight
48     ninety six    one hundred forty four    one hundred ninety two
49   ninety eight   one hundred forty seven    one hundred ninety six

                    Column_5                  Column_6
25   one hundred twenty five         one hundred fifty
26        one hundred thirty     one hundred fifty six
27   one hundred thirty five     one hundred sixty two
28         one hundred forty   one hundred sixty eight
29    one hundred forty five  one hundred seventy four
30         one hundred fifty        one hundred eighty
31    one hundred fifty five    one hundred eighty six
32         one hundred sixty    one hundred ninety two
33    one hundred sixty five  one hundred ninety eight
34       one hundred seventy          two hundred four
35  one hundred seventy five           two hundred ten
36        one hundred eighty       two hundred sixteen
37   one hundred eighty five    two hundred twenty two
38        one hundred ninety  two hundred twenty eight
39   one hundred ninety five   two hundred thirty four
40               two hundred         two hundred forty
41          two hundred five     two hundred forty six
42           two hundred ten     two hundred fifty two
43       two hundred fifteen   two hundred fifty eight
44        two hundred twenty    two hundred sixty four
45   two hundred twenty five       two hundred seventy
46        two hundred thirty   two hundred seventy six
47   two hundred thirty five    two hundred eighty two
48         two hundred forty  two hundred eighty eight
49    two hundred forty five   two hundred ninety four  , 'position': ((2, 7), (25, 50)), 'index': 0}
{'table':                     Column_2                   Column_3  \
50               one hundred          one hundred fifty
51           one hundred two    one hundred fifty three
52          one hundred four      one hundred fifty six
53           one hundred six     one hundred fifty nine
54         one hundred eight      one hundred sixty two
55           one hundred ten     one hundred sixty five
56        one hundred twelve    one hundred sixty eight
57      one hundred fourteen    one hundred seventy one
58       one hundred sixteen   one hundred seventy four
59      one hundred eighteen  one hundred seventy seven
60        one hundred twenty         one hundred eighty
61    one hundred twenty two   one hundred eighty three
62   one hundred twenty four     one hundred eighty six
63    one hundred twenty six    one hundred eighty nine
64  one hundred twenty eight     one hundred ninety two
65        one hundred thirty    one hundred ninety five
66    one hundred thirty two   one hundred ninety eight
67   one hundred thirty four            two hundred one
68    one hundred thirty six           two hundred four
69  one hundred thirty eight          two hundred seven
70         one hundred forty            two hundred ten
71     one hundred forty two       two hundred thirteen
72    one hundred forty four        two hundred sixteen
73     one hundred forty six       two hundred nineteen
74   one hundred forty eight     two hundred twenty two

                    Column_4                   Column_5  \
50               two hundred          two hundred fifty
51          two hundred four     two hundred fifty five
52         two hundred eight          two hundred sixty
53        two hundred twelve     two hundred sixty five
54       two hundred sixteen        two hundred seventy
55        two hundred twenty   two hundred seventy five
56   two hundred twenty four         two hundred eighty
57  two hundred twenty eight    two hundred eighty five
58    two hundred thirty two         two hundred ninety
59    two hundred thirty six    two hundred ninety five
60         two hundred forty              three hundred
61    two hundred forty four         three hundred five
62   two hundred forty eight          three hundred ten
63     two hundred fifty two      three hundred fifteen
64     two hundred fifty six       three hundred twenty
65         two hundred sixty  three hundred twenty five
66    two hundred sixty four       three hundred thirty
67   two hundred sixty eight  three hundred thirty five
68   two hundred seventy two        three hundred forty
69   two hundred seventy six   three hundred forty five
70        two hundred eighty        three hundred fifty
71   two hundred eighty four   three hundred fifty five
72  two hundred eighty eight        three hundred sixty
73    two hundred ninety two   three hundred sixty five
74    two hundred ninety six      three hundred seventy

                       Column_6
50                three hundred
51            three hundred six
52         three hundred twelve
53       three hundred eighteen
54    three hundred twenty four
55         three hundred thirty
56     three hundred thirty six
57      three hundred forty two
58    three hundred forty eight
59     three hundred fifty four
60          three hundred sixty
61      three hundred sixty six
62    three hundred seventy two
63  three hundred seventy eight
64    three hundred eighty four
65         three hundred ninety
66     three hundred ninety six
67             four hundred two
68           four hundred eight
69        four hundred fourteen
70          four hundred twenty
71      four hundred twenty six
72      four hundred thirty two
73    four hundred thirty eight
74      four hundred forty four  , 'position': ((2, 7), (50, 75)), 'index': 0}
{'table':                      Column_2                   Column_3  \
75          one hundred fifty    two hundred twenty five
76      one hundred fifty two   two hundred twenty eight
77     one hundred fifty four     two hundred thirty one
78      one hundred fifty six    two hundred thirty four
79    one hundred fifty eight   two hundred thirty seven
80          one hundred sixty          two hundred forty
81      one hundred sixty two    two hundred forty three
82     one hundred sixty four      two hundred forty six
83      one hundred sixty six     two hundred forty nine
84    one hundred sixty eight      two hundred fifty two
85        one hundred seventy     two hundred fifty five
86    one hundred seventy two    two hundred fifty eight
87   one hundred seventy four      two hundred sixty one
88    one hundred seventy six     two hundred sixty four
89  one hundred seventy eight    two hundred sixty seven
90         one hundred eighty        two hundred seventy
91     one hundred eighty two  two hundred seventy three
92    one hundred eighty four    two hundred seventy six
93     one hundred eighty six   two hundred seventy nine
94   one hundred eighty eight     two hundred eighty two
95         one hundred ninety    two hundred eighty five
96     one hundred ninety two   two hundred eighty eight
97    one hundred ninety four     two hundred ninety one
98     one hundred ninety six    two hundred ninety four
99   one hundred ninety eight   two hundred ninety seven

                      Column_4                    Column_5  \
75               three hundred  three hundred seventy five
76          three hundred four        three hundred eighty
77         three hundred eight   three hundred eighty five
78        three hundred twelve        three hundred ninety
79       three hundred sixteen   three hundred ninety five
80        three hundred twenty                four hundred
81   three hundred twenty four           four hundred five
82  three hundred twenty eight            four hundred ten
83    three hundred thirty two        four hundred fifteen
84    three hundred thirty six         four hundred twenty
85         three hundred forty    four hundred twenty five
86    three hundred forty four         four hundred thirty
87   three hundred forty eight    four hundred thirty five
88     three hundred fifty two          four hundred forty
89     three hundred fifty six     four hundred forty five
90         three hundred sixty          four hundred fifty
91    three hundred sixty four     four hundred fifty five
92   three hundred sixty eight          four hundred sixty
93   three hundred seventy two     four hundred sixty five
94   three hundred seventy six        four hundred seventy
95        three hundred eighty   four hundred seventy five
96   three hundred eighty four         four hundred eighty
97  three hundred eighty eight    four hundred eighty five
98    three hundred ninety two         four hundred ninety
99    three hundred ninety six    four hundred ninety five

                     Column_6
75         four hundred fifty
76     four hundred fifty six
77     four hundred sixty two
78   four hundred sixty eight
79  four hundred seventy four
80        four hundred eighty
81    four hundred eighty six
82    four hundred ninety two
83  four hundred ninety eight
84          five hundred four
85           five hundred ten
86       five hundred sixteen
87    five hundred twenty two
88  five hundred twenty eight
89   five hundred thirty four
90         five hundred forty
91     five hundred forty six
92     five hundred fifty two
93   five hundred fifty eight
94    five hundred sixty four
95       five hundred seventy
96   five hundred seventy six
97    five hundred eighty two
98  five hundred eighty eight
99   five hundred ninety four  , 'position': ((2, 7), (75, 100)), 'index': 0}
{'table':         Column_2      Column_3      Column_4             Column_5  \
0           zero          zero          zero                 zero
1            two         three          four                 five
2           four           six         eight                  ten
3            six          nine        twelve              fifteen
4          eight        twelve       sixteen               twenty
5            ten       fifteen        twenty          twenty five
6         twelve      eighteen   twenty four               thirty
7       fourteen    twenty one  twenty eight          thirty five
8        sixteen   twenty four    thirty two                forty
9       eighteen  twenty seven    thirty six           forty five
10        twenty        thirty         forty                fifty
11    twenty two  thirty three    forty four           fifty five
12   twenty four    thirty six   forty eight                sixty
13    twenty six   thirty nine     fifty two           sixty five
14  twenty eight     forty two     fifty six              seventy
15        thirty    forty five         sixty         seventy five
16    thirty two   forty eight    sixty four               eighty
17   thirty four     fifty one   sixty eight          eighty five
18    thirty six    fifty four   seventy two               ninety
19  thirty eight   fifty seven   seventy six          ninety five
20         forty         sixty        eighty          one hundred
21     forty two   sixty three   eighty four     one hundred five
22    forty four     sixty six  eighty eight      one hundred ten
23     forty six    sixty nine    ninety two  one hundred fifteen
24   forty eight   seventy two    ninety six   one hundred twenty

                    Column_6
0                       zero
1                        six
2                     twelve
3                   eighteen
4                twenty four
5                     thirty
6                 thirty six
7                  forty two
8                forty eight
9                 fifty four
10                     sixty
11                 sixty six
12               seventy two
13             seventy eight
14               eighty four
15                    ninety
16                ninety six
17           one hundred two
18         one hundred eight
19      one hundred fourteen
20        one hundred twenty
21    one hundred twenty six
22    one hundred thirty two
23  one hundred thirty eight
24    one hundred forty four  , 'position': ((2, 7), (0, 25)), 'index': 1}
{'table':          Column_2                  Column_3                  Column_4  \
25          fifty              seventy five               one hundred
26      fifty two             seventy eight          one hundred four
27     fifty four                eighty one         one hundred eight
28      fifty six               eighty four        one hundred twelve
29    fifty eight              eighty seven       one hundred sixteen
30          sixty                    ninety        one hundred twenty
31      sixty two              ninety three   one hundred twenty four
32     sixty four                ninety six  one hundred twenty eight
33      sixty six               ninety nine    one hundred thirty two
34    sixty eight           one hundred two    one hundred thirty six
35        seventy          one hundred five         one hundred forty
36    seventy two         one hundred eight    one hundred forty four
37   seventy four        one hundred eleven   one hundred forty eight
38    seventy six      one hundred fourteen     one hundred fifty two
39  seventy eight     one hundred seventeen     one hundred fifty six
40         eighty        one hundred twenty         one hundred sixty
41     eighty two  one hundred twenty three    one hundred sixty four
42    eighty four    one hundred twenty six   one hundred sixty eight
43     eighty six   one hundred twenty nine   one hundred seventy two
44   eighty eight    one hundred thirty two   one hundred seventy six
45         ninety   one hundred thirty five        one hundred eighty
46     ninety two  one hundred thirty eight   one hundred eighty four
47    ninety four     one hundred forty one  one hundred eighty eight
48     ninety six    one hundred forty four    one hundred ninety two
49   ninety eight   one hundred forty seven    one hundred ninety six

                    Column_5                  Column_6
25   one hundred twenty five         one hundred fifty
26        one hundred thirty     one hundred fifty six
27   one hundred thirty five     one hundred sixty two
28         one hundred forty   one hundred sixty eight
29    one hundred forty five  one hundred seventy four
30         one hundred fifty        one hundred eighty
31    one hundred fifty five    one hundred eighty six
32         one hundred sixty    one hundred ninety two
33    one hundred sixty five  one hundred ninety eight
34       one hundred seventy          two hundred four
35  one hundred seventy five           two hundred ten
36        one hundred eighty       two hundred sixteen
37   one hundred eighty five    two hundred twenty two
38        one hundred ninety  two hundred twenty eight
39   one hundred ninety five   two hundred thirty four
40               two hundred         two hundred forty
41          two hundred five     two hundred forty six
42           two hundred ten     two hundred fifty two
43       two hundred fifteen   two hundred fifty eight
44        two hundred twenty    two hundred sixty four
45   two hundred twenty five       two hundred seventy
46        two hundred thirty   two hundred seventy six
47   two hundred thirty five    two hundred eighty two
48         two hundred forty  two hundred eighty eight
49    two hundred forty five   two hundred ninety four  , 'position': ((2, 7), (25, 50)), 'index': 1}
{'table':                     Column_2                   Column_3  \
50               one hundred          one hundred fifty
51           one hundred two    one hundred fifty three
52          one hundred four      one hundred fifty six
53           one hundred six     one hundred fifty nine
54         one hundred eight      one hundred sixty two
55           one hundred ten     one hundred sixty five
56        one hundred twelve    one hundred sixty eight
57      one hundred fourteen    one hundred seventy one
58       one hundred sixteen   one hundred seventy four
59      one hundred eighteen  one hundred seventy seven

In [77]:
example_tables = chunk_neighbor_tables([df_long_table_multiplied, df_long_table_multiplied],  'Column_4',2, 'bert-base-uncased', 512, tokenizer)

In [78]:
model_name = 'bert-base-uncased'
dataset = TableColumnDataset(example_tables, tokenizer, 512, "[PAD]", model_name)

In [79]:
from torch.utils.data import DataLoader
dataloader = DataLoader(dataset, batch_size=32, shuffle=False)

In [80]:
for batch in dataloader:
    if model_name.startswith("google/tapas"):
        inputs, positions, indices = batch
        print(inputs)
        print(positions)
        print(indices)
        # Further processing for TAPAS model...
    else:
        input_ids, attention_mask, token_positions, positions, indices = batch
        print(input_ids)
        print(attention_mask)
        print(token_positions)
        print(positions)
        print(indices)

tensor([[ 101, 5930, 1035,  ...,    0,    0,    0],
        [ 101, 5930, 1035,  ...,    0,    0,    0],
        [ 101, 5930, 1035,  ...,    0,    0,    0],
        ...,
        [ 101, 5930, 1035,  ...,    0,    0,    0],
        [ 101, 5930, 1035,  ...,    0,    0,    0],
        [ 101, 5930, 1035,  ...,    0,    0,    0]])
tensor([[1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0],
        ...,
        [1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0],
        [1, 1, 1,  ..., 0, 0, 0]])
[tensor([0, 0, 0, 0, 0, 0, 0, 0]), tensor([41, 49, 90, 99, 41, 49, 90, 99]), tensor([ 86, 127, 185, 201,  86, 127, 185, 201]), tensor([131, 221, 279, 295, 131, 221, 279, 295]), tensor([177, 310, 367, 384, 177, 310, 367, 384])]
[[tensor([2, 2, 2, 2, 2, 2, 2, 2]), tensor([7, 7, 7, 7, 7, 7, 7, 7])], [tensor([ 0, 25, 50, 75,  0, 25, 50, 75]), tensor([ 25,  50,  75, 100,  25,  50,  75, 100])]]
tensor([0, 0, 0, 0, 1, 1, 1, 1])

In [8]:
from transformers import AutoTokenizer, AutoModelForSeq2SeqLM
import pandas as pd

tokenizer = AutoTokenizer.from_pretrained("microsoft/tapex-large-finetuned-wtq")
model = AutoModelForSeq2SeqLM.from_pretrained("microsoft/tapex-large-finetuned-wtq")

# prepare table + question
data = {"Actors": ["Brad Pitt", "Leonardo Di Caprio", "George Clooney"], "Number of movies": ["87", "53", "69"]}
table = pd.DataFrame.from_dict(data)
question = "abc"

encoding = tokenizer(table, question, return_tensors="pt")

# let the model generate an answer autoregressively
outputs = model.generate(**encoding)

# decode back to text
predicted_answer = tokenizer.batch_decode(outputs, skip_special_tokens=True)[0]
print(predicted_answer)

c:\Users\Ben\anaconda3\envs\545\lib\site-packages\transformers\generation\utils.py:1288: UserWarning: Neither `max_length` nor `max_new_tokens` has been set, `max_length` will default to 1024 (`generation_config.max_length`). Controlling `max_length` via the config is deprecated and `max_length` will be removed from the config in v5 of Transformers -- we recommend using `max_new_tokens` to control the maximum length of the generation.
  warnings.warn(

 kalimba edwards

In [43]:
tokenizer = AutoTokenizer.from_pretrained("microsoft/tapex-large-finetuned-tabfact")
col_tokens = tokenizer.tokenize("Brad Pitt")
input_ids = tokenizer.convert_tokens_to_ids(col_tokens)
print(col_tokens)
print(input_ids)

['br', 'ad', 'Ġp', 'itt']
[3809, 625, 181, 2582]

In [42]:
data = {"Actors": ["Brad Pitt", "Leonardo Di Caprio", "George Clooney"], "Number of movies": ["87", "53", "69"]}
table = pd.DataFrame.from_dict(data)
encoding = tokenizer(table, "", return_tensors="pt")
print(encoding)

You provide nothing to query with respect to the table.

{'input_ids': tensor([[    0,  9119,  4832,  5552,  1721,   346,     9,  4133,  3236,   112,
          4832,  5378,   625,   181,  2582,  1721,  8176,  3236,   132,  4832,
          2084,   261,  6782,  2269,  2927, 12834,  1721,  4268,  3236,   155,
          4832,  5473, 26875, 42771,  6071,  1721,  5913,     2]]), 'attention_mask': tensor([[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
         1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]])}

In [36]:
data = {"Actors": ["Brad Pitt", "Leonardo Di Caprio", "George Clooney"]}
table = pd.DataFrame.from_dict(data)
encoding = tokenizer(table, "", return_tensors="pt")
print(encoding['input_ids'])

You provide nothing to query with respect to the table.

tensor([[    0,  9119,  4832,  5552,  3236,   112,  4832,  5378,   625,   181,
          2582,  3236,   132,  4832,  2084,   261,  6782,  2269,  2927, 12834,
          3236,   155,  4832,  5473, 26875, 42771,  6071,     2]])

In [32]:
data = {"Actors": ["Brad Pitt"]}
table = pd.DataFrame.from_dict(data)
encoding = tokenizer(table, "", return_tensors="pt")
print(encoding['input_ids'])

You provide nothing to query with respect to the table.

tensor([[    0, 11311,  4832,  5552,  3236,   112,  4832,  5378,   625,   181,
          2582,     2]])

In [31]:
data = {"Actors": [""]}
table = pd.DataFrame.from_dict(data)
encoding = tokenizer(table, "", return_tensors="pt")
print(encoding['input_ids'])

You provide nothing to query with respect to the table.

tensor([[    0, 11311,  4832,  5552,  3236,   112,  4832,     2]])

In [33]:
data = {"": [""]}
table = pd.DataFrame.from_dict(data)
encoding = tokenizer(table, "", return_tensors="pt")
print(encoding['input_ids'])

You provide nothing to query with respect to the table.

tensor([[    0, 11311,  4832,  1437,  3236,   112,  4832,     2]])

In [14]:
import torch

def get_s_token_embedding(model, tokenizer, table, question):
    # Tokenize the table and question
    encoding = tokenizer(table, question, return_tensors="pt")

    # Extract input IDs from the encoding
    input_ids = encoding['input_ids']

    # Pass the input IDs through the embed_tokens layer
    embeddings_output = model.model.encoder.embed_tokens(input_ids)
    print(embeddings_output.shape)

    # Get the token ID for <s>
    token_id = tokenizer.convert_tokens_to_ids('<s>')

    # Fetch the embeddings for <s> token from the output
    s_token_embedding = embeddings_output[0][input_ids[0] == token_id]

    return s_token_embedding

# Example usage:
embedding = get_s_token_embedding(model, tokenizer, table, question)
print(embedding.shape)

torch.Size([1, 40, 1024])
torch.Size([1, 1024])

In [12]:
def get_decoder_last_hidden_state(model, tokenizer, table, question):
    # Tokenize the table and question
    encoding = tokenizer(table, question, return_tensors="pt")

    # Use the forward method of the model to get the outputs
    outputs = model(**encoding)

    # The first output is typically the last hidden state of the decoder
    decoder_last_hidden_state = outputs[0]

    return decoder_last_hidden_state

# Example usage:
decoder_hidden_state = get_decoder_last_hidden_state(model, tokenizer, table, question)
print(decoder_hidden_state.shape)

torch.Size([1, 40, 50265])

In [19]:
def get_lm_head_inputs(model, tokenizer, table, question):
    # Tokenize the table and question
    encoding = tokenizer(table, question, return_tensors="pt")

    # Use the forward method of the model to get the outputs
    outputs = model(**encoding)

    # The first output is typically the last hidden state of the decoder
    decoder_last_hidden_state = outputs[0]

    return decoder_last_hidden_state

# Example usage:
lm_head_input = get_lm_head_inputs(model, tokenizer, table, question)
print(lm_head_input.shape)

torch.Size([1, 40, 50265])

In [22]:
def get_decoder_output_before_lm_head(model, tokenizer, table, question):
    # Tokenize the table and question
    encoding = tokenizer(table, question, return_tensors="pt")
    input_ids = encoding['input_ids']
    attention_mask = encoding.get('attention_mask', None)

    # Directly use the model's BART structure to get the encoder's output
    encoder_outputs = model.model.encoder(input_ids, attention_mask=attention_mask)
    
    # Retrieve decoder's output using encoder's outputs and attention mask
    decoder_outputs = model.model.decoder(
        input_ids=input_ids, 
        encoder_hidden_states=encoder_outputs[0], 
        attention_mask=attention_mask
    )

    # The first output of the decoder contains the last hidden states
    return decoder_outputs[0]

# Example usage:
decoder_output = get_decoder_output_before_lm_head(model, tokenizer, table, question)
print(decoder_output.shape)

torch.Size([1, 40, 1024])

In [24]:
print(encoding)

{'input_ids': tensor([[    0,  4091,   438, 11311,  4832,  5552,  1721,   346,     9,  4133,
          3236,   112,  4832,  5378,   625,   181,  2582,  1721,  8176,  3236,
           132,  4832,  2084,   261,  6782,  2269,  2927, 12834,  1721,  4268,
          3236,   155,  4832,  5473, 26875, 42771,  6071,  1721,  5913,     2]]), 'attention_mask': tensor([[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
         1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]])}